data = [{
      name: '淘宝',
      data: [10,20,30,100,39,238,383,847,74,20,347,23,742,847,27,37,20,30,100,39,238,383,847,74,20,347,23,742,847,27,20,30,100,39,238,383,847,74,20,347,23,742,847,27,20,30,100,39,238,383,847,74,20,347,23,742,847]
    },{
      name: '京东',
      data: [98,847,76,474,67,878,873,673,636,623,663,663,66,83,371,377,847,76,474,67,878,873,673,636,623,663,663,66,83,371,847,76,474,67,878,873,673,636,623,663,663,66,83,371,847,76,474,67,878,873,673,636,623,663,663,66,83]
    },{
      name: '拼多多',
      data: [323,334,74,64,823,45,78,776,874,973,747,749,89,877,287,478,334,74,64,823,45,78,776,874,973,747,749,89,877,287,334,74,64,823,45,78,776,874,973,747,749,89,877,287,334,74,64,823,45,78,776,874,973,747,749,89,877]
    }]


Highcharts.setOptions({ colors: ['#EF4836','#26C281','#4B77BE','#00ceb7','#00c84b','#aab500','#ed9900','#ff7a9e'] });



$(init);

function init() {
  var chart = Highcharts.chart('g-chart', {
    chart: {
        type: 'bar'
    },
    title: {
        text: '运营综合报表'
    },
    subtitle: {
        text: ''
    },
    xAxis: {
        categories: ['注册商家数','注册商家vip数','注册商家活跃用户数','绑定淘宝店数','垫付任务发布数','垫付任务发布单数','垫付任务接单数','垫付任务接单率','垫付任务完成数','垫付任务完成率','垫付任务平均完成时间','浏览任务发布数','浏览任务发布单数','浏览任务接单数','浏览任务接单率','浏览任务完成数','浏览任务完成率','浏览任务平均完成时间','商家发布任务金额平均数','刷手平均垫付金额','刷手平均完成垫付任务时间','刷手平均完成浏览任务时间','注册刷手数','注册刷手vip数','注册刷手活跃用户数','注册淘宝id数','商家二次发布任务数','商家二次发布任务率','刷手二次接任务数','刷手二次接任务率','同时在线商家数','商家当日在线时间','同时在线买家数','买家当日在线时间','同时在线总人数','总访问数','商家ip地址统计','刷手ip地址统计','商家类目统计','刷手年龄统计','刷手性别统计','刷手淘宝等级统计','商家返款预期率','同比/环比增长率(图表)','区域限制占比','年龄限制占比','刷手终端分布占比','垫付区间占比','审核通过率','坏账率','刷手/商家活跃周期率','活跃刷手区域占比','刷手撤单率','平台撤单率(刷手/商家)','季度/半年/年最佳排名','周期内总发任务数与被接单数','限制任务单数'],
        title: {
            text: null
        }
    },
    yAxis: {
        min: 0,
        title: {
            text: '数量 (个)',
            align: 'high'
        },
        labels: {
            overflow: 'justify'
        }
    },
    tooltip: {
        valueSuffix: ' 个'
    },
    plotOptions: {
        bar: {
            dataLabels: {
                enabled: true,
                allowOverlap: true // 允许数据标签重叠
            }
        }
    },
    legend: {
        layout: 'vertical',
        align: 'right',
        verticalAlign: 'top',
        x: -40,
        y: 100,
        floating: true,
        borderWidth: 1,
        backgroundColor: ((Highcharts.theme && Highcharts.theme.legendBackgroundColor) || '#FFFFFF'),
        shadow: true
    },
    series: data
});
}